military_button = "Справка в военкомат"
gcvp_button = "Справка ГЦВП"
requirement_button = "Справка по месту требования"

instruction1_button_text = "📑 Инструкция по заполнению заявок на справки"
instruction2_button_text = "📑 Инструкция по заполнению заявок на заявления"
almaunion_link_button_text = "🌐 Ссылка на AlmaUnion, для получения справки онлайн"

add_certificate_button = "📤 Добавить инструкцию"
edit_certificate_button = "♻ Обновить текст инструкции"
add_doc_certificate_button = "➕ Прикрепить документ к инструкции"
delete_certificate_button = "❌ Удалить инструкцию"

cancel_certificate_button = "❌ Отмена отправки справки"

request_button_text = "✉ Оставить заявку для получения справки физически"
send_request_button_text = "✅ Отправить заявку"
cancel_request_button_text = "❌ Отмена запроса"
